nsubtil/teppic/core/cpu/pic18f2550_registers.h
/*
  Copyright (C) 2010, Nuno Subtil

  This file is part of Teppic.

  Teppic is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  
  Teppic is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  
  You should have received a copy of the GNU General Public License
  along with Teppic.  If not, see <http://www.gnu.org/licenses/>.
*/

#if defined (__PIC_REGISTER_FILE__)
#error multiple register file headers included
#else
#define __PIC_REGISTER_FILE__
#endif

// PIC18F2550 processor register definition file
// Generated from p18f2550.inc in the gputils package

// This header file defines configurations, registers, and other useful
// bits of information for the PIC18F2550 microcontroller.  These names
// are taken to match the data sheets as closely as possible.

#define __PIC18F2550__

// ==========================================================================
// 
//        Register Definitions
// 
// ==========================================================================

// ----- Register Files -----------------------------------------------------
#define UFRM              0x0F66
#define UFRML             0x0F66
#define UFRMH             0x0F67
#define UIR               0x0F68
#define UIE               0x0F69
#define UEIR              0x0F6A
#define UEIE              0x0F6B
#define USTAT             0x0F6C
#define UCON              0x0F6D
#define UADDR             0x0F6E
#define UCFG              0x0F6F
#define UEP0              0x0F70
#define UEP1              0x0F71
#define UEP2              0x0F72
#define UEP3              0x0F73
#define UEP4              0x0F74
#define UEP5              0x0F75
#define UEP6              0x0F76
#define UEP7              0x0F77
#define UEP8              0x0F78
#define UEP9              0x0F79
#define UEP10             0x0F7A
#define UEP11             0x0F7B
#define UEP12             0x0F7C
#define UEP13             0x0F7D
#define UEP14             0x0F7E
#define UEP15             0x0F7F
#define PORTA             0x0F80
#define PORTB             0x0F81
#define PORTC             0x0F82
#define PORTE             0x0F84
#define LATA              0x0F89
#define LATB              0x0F8A
#define LATC              0x0F8B
#define DDRA              0x0F92
#define TRISA             0x0F92
#define DDRB              0x0F93
#define TRISB             0x0F93
#define DDRC              0x0F94
#define TRISC             0x0F94
#define OSCTUNE           0x0F9B
#define PIE1              0x0F9D
#define PIR1              0x0F9E
#define IPR1              0x0F9F
#define PIE2              0x0FA0
#define PIR2              0x0FA1
#define IPR2              0x0FA2
#define EECON1            0x0FA6
#define EECON2            0x0FA7
#define EEDATA            0x0FA8
#define EEADR             0x0FA9
#define RCSTA             0x0FAB
#define TXSTA             0x0FAC
#define TXREG             0x0FAD
#define RCREG             0x0FAE
#define SPBRG             0x0FAF
#define SPBRGH            0x0FB0
#define T3CON             0x0FB1
#define TMR3L             0x0FB2
#define TMR3H             0x0FB3
#define CMCON             0x0FB4
#define CVRCON            0x0FB5
#define CCP1AS            0x0FB6
#define ECCP1AS           0x0FB6
#define CCP1DEL           0x0FB7
#define ECCP1DEL          0x0FB7
#define BAUDCON           0x0FB8
#define CCP2CON           0x0FBA
#define CCPR2             0x0FBB
#define CCPR2L            0x0FBB
#define CCPR2H            0x0FBC
#define CCP1CON           0x0FBD
#define CCPR1             0x0FBE
#define CCPR1L            0x0FBE
#define CCPR1H            0x0FBF
#define ADCON2            0x0FC0
#define ADCON1            0x0FC1
#define ADCON0            0x0FC2
#define ADRES             0x0FC3
#define ADRESL            0x0FC3
#define ADRESH            0x0FC4
#define SSPCON2           0x0FC5
#define SSPCON1           0x0FC6
#define SSPSTAT           0x0FC7
#define SSPADD            0x0FC8
#define SSPBUF            0x0FC9
#define T2CON             0x0FCA
#define PR2               0x0FCB
#define TMR2              0x0FCC
#define T1CON             0x0FCD
#define TMR1L             0x0FCE
#define TMR1H             0x0FCF
#define RCON              0x0FD0
#define WDTCON            0x0FD1
#define HLVDCON           0x0FD2
#define LVDCON            0x0FD2
#define OSCCON            0x0FD3
#define T0CON             0x0FD5
#define TMR0L             0x0FD6
#define TMR0H             0x0FD7
#define STATUS            0x0FD8
#define FSR2L             0x0FD9
#define FSR2H             0x0FDA
#define PLUSW2            0x0FDB
#define PREINC2           0x0FDC
#define POSTDEC2          0x0FDD
#define POSTINC2          0x0FDE
#define INDF2             0x0FDF
#define BSR               0x0FE0
#define FSR1L             0x0FE1
#define FSR1H             0x0FE2
#define PLUSW1            0x0FE3
#define PREINC1           0x0FE4
#define POSTDEC1          0x0FE5
#define POSTINC1          0x0FE6
#define INDF1             0x0FE7
#define WREG              0x0FE8
#define FSR0L             0x0FE9
#define FSR0H             0x0FEA
#define PLUSW0            0x0FEB
#define PREINC0           0x0FEC
#define POSTDEC0          0x0FED
#define POSTINC0          0x0FEE
#define INDF0             0x0FEF
#define INTCON3           0x0FF0
#define INTCON2           0x0FF1
#define INTCON            0x0FF2
#define PROD              0x0FF3
#define PRODL             0x0FF3
#define PRODH             0x0FF4
#define TABLAT            0x0FF5
#define TBLPTR            0x0FF6
#define TBLPTRL           0x0FF6
#define TBLPTRH           0x0FF7
#define TBLPTRU           0x0FF8
//#define PC                0x0FF9
#define PCL               0x0FF9
#define PCLATH            0x0FFA
#define PCLATU            0x0FFB
#define STKPTR            0x0FFC
#define TOS               0x0FFD
#define TOSL              0x0FFD
#define TOSH              0x0FFE
#define TOSU              0x0FFF

