nsubtil/teppic/core/cpu/pic18f2550_registers.h
// ----- UFRML Bits -----------------------------------------------------
#define FRM0              0x0000
#define FRM1              0x0001
#define FRM2              0x0002
#define FRM3              0x0003
#define FRM4              0x0004
#define FRM5              0x0005
#define FRM6              0x0006
#define FRM7              0x0007

// ----- UFRMH Bits -----------------------------------------------------
#define FRM8              0x0000
#define FRM9              0x0001
#define FRM10             0x0002

// ----- UIR Bits -----------------------------------------------------
#define URSTIF            0x0000
#define UERRIF            0x0001
#define ACTVIF            0x0002
#define TRNIF             0x0003
#define IDLEIF            0x0004
#define STALLIF           0x0005
#define SOFIF             0x0006

// ----- UIE Bits -----------------------------------------------------
#define URSTIE            0x0000
#define UERRIE            0x0001
#define ACTVIE            0x0002
#define TRNIE             0x0003
#define IDLEIE            0x0004
#define STALLIE           0x0005
#define SOFIE             0x0006

// ----- UEIR Bits -----------------------------------------------------
#define PIDEF             0x0000
#define CRC5EF            0x0001
#define CRC16EF           0x0002
#define DFN8EF            0x0003
#define BTOEF             0x0004
#define BTSEF             0x0007

// ----- UEIE Bits -----------------------------------------------------
#define PIDEE             0x0000
#define CRC5EE            0x0001
#define CRC16EE           0x0002
#define DFN8EE            0x0003
#define BTOEE             0x0004
#define BTSEE             0x0007

// ----- USTAT Bits -----------------------------------------------------
#define PPBI              0x0001
#define DIR               0x0002
#define ENDP0             0x0003
#define ENDP1             0x0004
#define ENDP2             0x0005
#define ENDP3             0x0006

// ----- UCON Bits -----------------------------------------------------
#define SUSPND            0x0001
#define RESUME            0x0002
#define USBEN             0x0003
#define PKTDIS            0x0004
#define SE0               0x0005
#define PPBRST            0x0006

// ----- UADDR Bits -----------------------------------------------------
#define ADDR0             0x0000
#define ADDR1             0x0001
#define ADDR2             0x0002
#define ADDR3             0x0003
#define ADDR4             0x0004
#define ADDR5             0x0005
#define ADDR6             0x0006

// ----- UCFG Bits -----------------------------------------------------
#define PPB0              0x0000
#define PPB1              0x0001
#define FSEN              0x0002
#define UTRDIS            0x0003
#define UPUEN             0x0004
#define UOEMON            0x0006
#define UTEYE             0x0007

// ----- UEP0 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP1 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP2 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP3 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP4 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP5 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP6 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP7 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP8 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP9 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP10 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP11 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP12 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP13 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

