nsubtil/teppic/core/cpu/pic18f2550_registers.h
// ----- UEP14 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- UEP15 Bits -----------------------------------------------------
#define EPSTALL           0x0000
#define EPINEN            0x0001
#define EPOUTEN           0x0002
#define EPCONDIS          0x0003
#define EPHSHK            0x0004

// ----- PORTA Bits -----------------------------------------------------
#define RA0               0x0000
#define RA1               0x0001
#define RA2               0x0002
#define RA3               0x0003
#define RA4               0x0004
#define RA5               0x0005
#define RA6               0x0006
#define AN0               0x0000
#define AN1               0x0001
#define AN2               0x0002
#define AN3               0x0003
#define T0CKI             0x0004
#define AN4               0x0005
#define OSC2              0x0006
#define VREFM             0x0002
#define VREFP             0x0003
#define LVDIN             0x0005
#define HLVDIN            0x0005

// ----- PORTB Bits -----------------------------------------------------
#define RB0               0x0000
#define RB1               0x0001
#define RB2               0x0002
#define RB3               0x0003
#define RB4               0x0004
#define RB5               0x0005
#define RB6               0x0006
#define RB7               0x0007
#define INT0              0x0000
#define INT1              0x0001
#define INT2              0x0002
#define PGM               0x0005
#define PGC               0x0006
#define PGD               0x0007

// ----- PORTC Bits -----------------------------------------------------
#define RC0               0x0000
#define RC1               0x0001
#define RC2               0x0002
#define RC4               0x0004
#define RC5               0x0005
#define RC6               0x0006
#define RC7               0x0007
#define T1OSO             0x0000
#define T1OSI             0x0001
#define CCP1              0x0002
#define TX                0x0006
#define RX                0x0007
#define T13CKI            0x0000
#define P1A               0x0002
#define CK                0x0006
#define DT                0x0007

// ----- PORTE Bits -----------------------------------------------------
#define RE3               0x0003

// ----- LATA Bits -----------------------------------------------------
#define LATA0             0x0000
#define LATA1             0x0001
#define LATA2             0x0002
#define LATA3             0x0003
#define LATA4             0x0004
#define LATA5             0x0005
#define LATA6             0x0006

// ----- LATB Bits -----------------------------------------------------
#define LATB0             0x0000
#define LATB1             0x0001
#define LATB2             0x0002
#define LATB3             0x0003
#define LATB4             0x0004
#define LATB5             0x0005
#define LATB6             0x0006
#define LATB7             0x0007

// ----- LATC Bits -----------------------------------------------------
#define LATC0             0x0000
#define LATC1             0x0001
#define LATC2             0x0002
#define LATC6             0x0006
#define LATC7             0x0007

// ----- DDRA Bits -----------------------------------------------------
#define RA0               0x0000
#define RA1               0x0001
#define RA2               0x0002
#define RA3               0x0003
#define RA4               0x0004
#define RA5               0x0005
#define RA6               0x0006

// ----- TRISA Bits -----------------------------------------------------
#define TRISA0            0x0000
#define TRISA1            0x0001
#define TRISA2            0x0002
#define TRISA3            0x0003
#define TRISA4            0x0004
#define TRISA5            0x0005
#define TRISA6            0x0006

// ----- DDRB Bits -----------------------------------------------------
#define RB0               0x0000
#define RB1               0x0001
#define RB2               0x0002
#define RB3               0x0003
#define RB4               0x0004
#define RB5               0x0005
#define RB6               0x0006
#define RB7               0x0007

// ----- TRISB Bits -----------------------------------------------------
#define TRISB0            0x0000
#define TRISB1            0x0001
#define TRISB2            0x0002
#define TRISB3            0x0003
#define TRISB4            0x0004
#define TRISB5            0x0005
#define TRISB6            0x0006
#define TRISB7            0x0007

// ----- DDRC Bits -----------------------------------------------------
#define RC0               0x0000
#define RC1               0x0001
#define RC2               0x0002
#define RC6               0x0006
#define RC7               0x0007

// ----- TRISC Bits -----------------------------------------------------
#define TRISC0            0x0000
#define TRISC1            0x0001
#define TRISC2            0x0002
#define TRISC6            0x0006
#define TRISC7            0x0007

// ----- OSCTUNE Bits -----------------------------------------------------
#define TUN0              0x0000
#define TUN1              0x0001
#define TUN2              0x0002
#define TUN3              0x0003
#define TUN4              0x0004
#define INTSRC            0x0007

// ----- PIE1 Bits -----------------------------------------------------
#define TMR1IE            0x0000
#define TMR2IE            0x0001
#define CCP1IE            0x0002
#define SSPIE             0x0003
#define TXIE              0x0004
#define RCIE              0x0005
#define ADIE              0x0006

// ----- PIR1 Bits -----------------------------------------------------
#define TMR1IF            0x0000
#define TMR2IF            0x0001
#define CCP1IF            0x0002
#define SSPIF             0x0003
#define TXIF              0x0004
#define RCIF              0x0005
#define ADIF              0x0006

// ----- IPR1 Bits -----------------------------------------------------
#define TMR1IP            0x0000
#define TMR2IP            0x0001
#define CCP1IP            0x0002
#define SSPIP             0x0003
#define TXIP              0x0004
#define RCIP              0x0005
#define ADIP              0x0006

