nsubtil/teppic/core/cpu/pic18f2550_registers.h
// ----- PIE2 Bits -----------------------------------------------------
#define CCP2IE            0x0000
#define TMR3IE            0x0001
#define LVDIE             0x0002
#define BCLIE             0x0003
#define EEIE              0x0004
#define USBIE             0x0005
#define CMIE              0x0006
#define OSCFIE            0x0007
#define HLVDIE            0x0002

// ----- PIR2 Bits -----------------------------------------------------
#define CCP2IF            0x0000
#define TMR3IF            0x0001
#define LVDIF             0x0002
#define BCLIF             0x0003
#define EEIF              0x0004
#define USBIF             0x0005
#define CMIF              0x0006
#define OSCFIF            0x0007
#define HLVDIF            0x0002

// ----- IPR2 Bits -----------------------------------------------------
#define CCP2IP            0x0000
#define TMR3IP            0x0001
#define LVDIP             0x0002
#define BCLIP             0x0003
#define EEIP              0x0004
#define USBIP             0x0005
#define CMIP              0x0006
#define OSCFIP            0x0007
#define HLVDIP            0x0002

// ----- EECON1 Bits -----------------------------------------------------
#define RD                0x0000
#define WR                0x0001
#define WREN              0x0002
#define WRERR             0x0003
#define FREE              0x0004
#define CFGS              0x0006
#define EEPGD             0x0007

// ----- RCSTA Bits -----------------------------------------------------
#define RX9D              0x0000
#define OERR              0x0001
#define FERR              0x0002
#define ADDEN             0x0003
#define CREN              0x0004
#define SREN              0x0005
#define RX9               0x0006
#define SPEN              0x0007
#define ADEN              0x0003

// ----- TXSTA Bits -----------------------------------------------------
#define TX9D              0x0000
#define TRMT              0x0001
#define BRGH              0x0002
#define SENDB             0x0003
#define SYNC              0x0004
#define TXEN              0x0005
#define TX9               0x0006
#define CSRC              0x0007

// ----- T3CON Bits -----------------------------------------------------
#define TMR3ON            0x0000
#define TMR3CS            0x0001
#define T3SYNC            0x0002
#define T3CCP1            0x0003
#define T3CKPS0           0x0004
#define T3CKPS1           0x0005
#define T3CCP2            0x0006
#define RD16              0x0007
#define T3NSYNC           0x0002
#define NOT_T3SYNC        0x0002

// ----- CMCON Bits -----------------------------------------------------
#define CM0               0x0000
#define CM1               0x0001
#define CM2               0x0002
#define CIS               0x0003
#define C1INV             0x0004
#define C2INV             0x0005
#define C1OUT             0x0006
#define C2OUT             0x0007

// ----- CVRCON Bits -----------------------------------------------------
#define CVR0              0x0000
#define CVR1              0x0001
#define CVR2              0x0002
#define CVR3              0x0003
#define CVREF             0x0004
#define CVRR              0x0005
#define CVROE             0x0006
#define CVREN             0x0007
#define CVRSS             0x0004

// ----- CCP1AS Bits -----------------------------------------------------
#define PSSAC0            0x0002
#define PSSAC1            0x0003
#define ECCPAS0           0x0004
#define ECCPAS1           0x0005
#define ECCPAS2           0x0006
#define ECCPASE           0x0007

// ----- ECCP1AS Bits -----------------------------------------------------
#define PSSAC0            0x0002
#define PSSAC1            0x0003
#define ECCPAS0           0x0004
#define ECCPAS1           0x0005
#define ECCPAS2           0x0006
#define ECCPASE           0x0007

// ----- CCP1DEL Bits -----------------------------------------------------
#define PRSEN             0x0007

// ----- ECCP1DEL Bits -----------------------------------------------------
#define PRSEN             0x0007

// ----- BAUDCON Bits -----------------------------------------------------
#define ABDEN             0x0000
#define WUE               0x0001
#define BRG16             0x0003
#define SCKP              0x0004
#define RCIDL             0x0006
#define ABDOVF            0x0007
#define TXCKP             0x0004
#define RXDTP             0x0005
#define RCMT              0x0006

// ----- CCP2CON Bits -----------------------------------------------------
#define CCP2M0            0x0000
#define CCP2M1            0x0001
#define CCP2M2            0x0002
#define CCP2M3            0x0003
#define DC2B0             0x0004
#define DC2B1             0x0005

// ----- CCP1CON Bits -----------------------------------------------------
#define CCP1M0            0x0000
#define CCP1M1            0x0001
#define CCP1M2            0x0002
#define CCP1M3            0x0003
#define DC1B0             0x0004
#define DC1B1             0x0005

// ----- ADCON2 Bits -----------------------------------------------------
#define ADCS0             0x0000
#define ADCS1             0x0001
#define ADCS2             0x0002
#define ACQT0             0x0003
#define ACQT1             0x0004
#define ACQT2             0x0005
#define ADFM              0x0007

// ----- ADCON1 Bits -----------------------------------------------------
#define PCFG0             0x0000
#define PCFG1             0x0001
#define PCFG2             0x0002
#define PCFG3             0x0003
#define VCFG0             0x0004
#define VCFG1             0x0005

// ----- ADCON0 Bits -----------------------------------------------------
#define ADON              0x0000
#define GO_DONE           0x0001
#define CHS0              0x0002
#define CHS1              0x0003
#define CHS2              0x0004
#define CHS3              0x0005
#define DONE              0x0001
#define GO                0x0001
#define NOT_DONE          0x0001

// ----- SSPCON2 Bits -----------------------------------------------------
#define SEN               0x0000
#define RSEN              0x0001
#define PEN               0x0002
#define RCEN              0x0003
#define ACKEN             0x0004
#define ACKDT             0x0005
#define ACKSTAT           0x0006
#define GCEN              0x0007

// ----- SSPCON1 Bits -----------------------------------------------------
#define SSPM0             0x0000
#define SSPM1             0x0001
#define SSPM2             0x0002
#define SSPM3             0x0003
#define CKP               0x0004
#define SSPEN             0x0005
#define SSPOV             0x0006
#define WCOL              0x0007

// ----- SSPSTAT Bits -----------------------------------------------------
#define BF                0x0000
#define UA                0x0001
#define R_W               0x0002
#define S                 0x0003
#define P                 0x0004
#define D_A               0x0005
#define CKE               0x0006
#define SMP               0x0007
#define I2C_READ          0x0002
#define I2C_START         0x0003
#define I2C_STOP          0x0004
#define I2C_DAT           0x0005
#define NOT_W             0x0002
#define NOT_A             0x0005
#define NOT_WRITE         0x0002
#define NOT_ADDRESS       0x0005
#define READ_WRITE        0x0002
#define DATA_ADDRESS      0x0005
#define R                 0x0002
#define D                 0x0005

// ----- T2CON Bits -----------------------------------------------------
#define T2CKPS0           0x0000
#define T2CKPS1           0x0001
#define TMR2ON            0x0002
#define T2OUTPS0          0x0003
#define T2OUTPS1          0x0004
#define T2OUTPS2          0x0005
#define T2OUTPS3          0x0006

// ----- T1CON Bits -----------------------------------------------------
#define TMR1ON            0x0000
#define TMR1CS            0x0001
#define T1SYNC            0x0002
#define T1OSCEN           0x0003
#define T1CKPS0           0x0004
#define T1CKPS1           0x0005
#define T1RUN             0x0006
#define RD16              0x0007
#define NOT_T1SYNC        0x0002

