nsubtil/teppic/core/cpu/pic18f2550_registers.h
//  The following is an assignment of address values for all of the
//  configuration registers for the purpose of table reads
#define _CONFIG1L         0x300000
#define _CONFIG1H         0x300001
#define _CONFIG2L         0x300002
#define _CONFIG2H         0x300003
#define _CONFIG3H         0x300005
#define _CONFIG4L         0x300006
#define _CONFIG5L         0x300008
#define _CONFIG5H         0x300009
#define _CONFIG6L         0x30000A
#define _CONFIG6H         0x30000B
#define _CONFIG7L         0x30000C
#define _CONFIG7H         0x30000D

// ----- CONFIG1L Options --------------------------------------------------
#define _PLLDIV_1_1L          0xF8
#define _PLLDIV_2_1L          0xF9
#define _PLLDIV_3_1L          0xFA
#define _PLLDIV_4_1L          0xFB
#define _PLLDIV_5_1L          0xFC
#define _PLLDIV_6_1L          0xFD
#define _PLLDIV_10_1L         0xFE
#define _PLLDIV_12_1L         0xFF
#define _CPUDIV_OSC1_PLL2_1L  0xE7
#define _CPUDIV_OSC2_PLL3_1L  0xEF
#define _CPUDIV_OSC3_PLL4_1L  0xF7
#define _CPUDIV_OSC4_PLL6_1L  0xFF
#define _USBDIV_1_1L          0xDF
#define _USBDIV_2_1L          0xFF

// ----- CONFIG1H Options --------------------------------------------------
#define _FOSC_XT_XT_1H        0xF0
#define _FOSC_XTPLL_XT_1H     0xF2
#define _FOSC_ECIO_EC_1H      0xF4
#define _FOSC_EC_EC_1H        0xF5
#define _FOSC_ECPLLIO_EC_1H   0xF6
#define _FOSC_ECPLL_EC_1H     0xF7
#define _FOSC_INTOSCIO_EC_1H  0xF8
#define _FOSC_INTOSC_EC_1H    0xF9
#define _FOSC_INTOSC_XT_1H    0xFA
#define _FOSC_INTOSC_HS_1H    0xFB
#define _FOSC_HS_1H           0xFC
#define _FOSC_HSPLL_HS_1H     0xFE
#define _FCMEN_OFF_1H         0xBF
#define _FCMEN_ON_1H          0xFF
#define _IESO_OFF_1H          0x7F
#define _IESO_ON_1H           0xFF

// ----- CONFIG2L Options --------------------------------------------------
#define _PWRT_ON_2L           0xFE
#define _PWRT_OFF_2L          0xFF
#define _BOR_OFF_2L           0xF9
#define _BOR_SOFT_2L          0xFB
#define _BOR_ON_ACTIVE_2L     0xFD
#define _BOR_ON_2L            0xFF
#define _BORV_0_2L            0xE7
#define _BORV_1_2L            0xEF
#define _BORV_2_2L            0xF7
#define _BORV_3_2L            0xFF
#define _VREGEN_OFF_2L        0xDF
#define _VREGEN_ON_2L         0xFF

// ----- CONFIG2H Options --------------------------------------------------
#define _WDT_OFF_2H           0xFE
#define _WDT_ON_2H            0xFF
#define _WDTPS_1_2H           0xE1
#define _WDTPS_2_2H           0xE3
#define _WDTPS_4_2H           0xE5
#define _WDTPS_8_2H           0xE7
#define _WDTPS_16_2H          0xE9
#define _WDTPS_32_2H          0xEB
#define _WDTPS_64_2H          0xED
#define _WDTPS_128_2H         0xEF
#define _WDTPS_256_2H         0xF1
#define _WDTPS_512_2H         0xF3
#define _WDTPS_1024_2H        0xF5
#define _WDTPS_2048_2H        0xF7
#define _WDTPS_4096_2H        0xF9
#define _WDTPS_8192_2H        0xFB
#define _WDTPS_16384_2H       0xFD
#define _WDTPS_32768_2H       0xFF

// ----- CONFIG3H Options --------------------------------------------------
#define _MCLRE_OFF_3H         0x7F
#define _MCLRE_ON_3H          0xFF
#define _LPT1OSC_OFF_3H       0xFB
#define _LPT1OSC_ON_3H        0xFF
#define _PBADEN_OFF_3H        0xFD
#define _PBADEN_ON_3H         0xFF
#define _CCP2MX_OFF_3H        0xFE
#define _CCP2MX_ON_3H         0xFF

// ----- CONFIG4L Options --------------------------------------------------
#define _STVREN_OFF_4L        0xFE
#define _STVREN_ON_4L         0xFF
#define _LVP_OFF_4L           0xFB
#define _LVP_ON_4L            0xFF
#define _XINST_OFF_4L         0xBF
#define _XINST_ON_4L          0xFF
#define _DEBUG_ON_4L          0x7F
#define _DEBUG_OFF_4L         0xFF

// ----- CONFIG5L Options --------------------------------------------------
#define _CP0_ON_5L            0xFE
#define _CP0_OFF_5L           0xFF
#define _CP1_ON_5L            0xFD
#define _CP1_OFF_5L           0xFF
#define _CP2_ON_5L            0xFB
#define _CP2_OFF_5L           0xFF
#define _CP3_ON_5L            0xF7
#define _CP3_OFF_5L           0xFF

// ----- CONFIG5H Options --------------------------------------------------
#define _CPB_ON_5H            0xBF
#define _CPB_OFF_5H           0xFF
#define _CPD_ON_5H            0x7F
#define _CPD_OFF_5H           0xFF

// ----- CONFIG6L Options --------------------------------------------------
#define _WRT0_ON_6L           0xFE
#define _WRT0_OFF_6L          0xFF
#define _WRT1_ON_6L           0xFD
#define _WRT1_OFF_6L          0xFF
#define _WRT2_ON_6L           0xFB
#define _WRT2_OFF_6L          0xFF
#define _WRT3_ON_6L           0xF7
#define _WRT3_OFF_6L          0xFF

// ----- CONFIG6H Options --------------------------------------------------
#define _WRTB_ON_6H           0xBF
#define _WRTB_OFF_6H          0xFF
#define _WRTC_ON_6H           0xDF
#define _WRTC_OFF_6H          0xFF
#define _WRTD_ON_6H           0x7F
#define _WRTD_OFF_6H          0xFF

// ----- CONFIG7L Options --------------------------------------------------
#define _EBTR0_ON_7L          0xFE
#define _EBTR0_OFF_7L         0xFF
#define _EBTR1_ON_7L          0xFD
#define _EBTR1_OFF_7L         0xFF
#define _EBTR2_ON_7L          0xFB
#define _EBTR2_OFF_7L         0xFF
#define _EBTR3_ON_7L          0xF7
#define _EBTR3_OFF_7L         0xFF

// ----- CONFIG7H Options --------------------------------------------------
#define _EBTRB_ON_7H          0xBF
#define _EBTRB_OFF_7H         0xFF
#define _DEVID1           0x3FFFFE
#define _DEVID2           0x3FFFFF
#define _IDLOC0           0x200000
#define _IDLOC1           0x200001
#define _IDLOC2           0x200002
#define _IDLOC3           0x200003
#define _IDLOC4           0x200004
#define _IDLOC5           0x200005
#define _IDLOC6           0x200006
#define _IDLOC7           0x200007
